src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СценарииЧатБотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СценарииЧатБотов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафическаСхемаСценария</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЭтапов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаПредопределенногоСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиСообщенийС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиСообщенийПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваЭтаповСценария</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭтапа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭтапа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭтапа</Name>
							<Comment>Тип объекта в схеме сценария</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормироватьСообщениеПоШаблону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СообщениеБота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеЭтапа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУсловийЭтапов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормироватьСтэкВариантовВыбораМетодом</Name>
							<Comment>Истина - варианты ответа будут сформированы методом и закешированы в регистр. Ложь - варианты ответа конфигурируются в схеме сценария.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодФормированияСтэкаВариантовВыбора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыФормированияСтэкаВариантовВыбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставлятьВыборВариантовКнопками</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодЭтапа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыСценариев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложенныйСценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииЧатБотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыРазвитияСценария</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭтапа</Name>
							<Comment>Тип объекта в схеме сценария</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВарианта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВетвления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БулевоТриСостояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтветов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующийЭтап</Name>
							<Comment>Идентификатор следующего этапа</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапВозврата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТриггерныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТриггерноеСобытие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУсловийТриггерныхСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - Обработка заполнения
//
// Параметры:
//  ДанныеЗаполнения	 - 	 - 
//  ТекстЗаполнения		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Используется = Истина;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЭтотОбъект.ПометкаУдаления Тогда 
		Если ЭтотОбъект.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi И ЭтотОбъект.Используется Тогда 
			ИнициализироватьДанныеВнешнейСистемыПередЗаписью();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	ИнициализацияМехнизмаРаботыСЧатБотом();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализировать данные внешней системы перед записью
//
Процедура ИнициализироватьДанныеВнешнейСистемыПередЗаписью()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтруктураДанныхПередЗаписью = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешниеСистемы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВнешниеСистемы.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	ВнешниеСистемы.Используется КАК Используется,
	|	ВнешниеСистемы.КлючПриложения КАК КлючПриложения,
	|	ВнешниеСистемы.КлючШифрования КАК КлючШифрования,
	|	ВнешниеСистемы.КлючШифрованияОбратногоЗвонка КАК КлючШифрованияОбратногоЗвонка,
	|	ВнешниеСистемы.Параметры КАК Параметры,
	|	ВнешниеСистемы.Синхронизирована КАК Синхронизирована,
	|	ВнешниеСистемы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы,
	|	ВнешниеСистемы.ТокенДоступа КАК ТокенДоступа,
	|	ВнешниеСистемы.УправлениеВЛичномКабинете КАК УправлениеВЛичномКабинете
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.Ссылка = &Ссылка";
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	Для Каждого Колонка Из ТаблицаСвойств.Колонки Цикл 
		СтруктураДанныхПередЗаписью.Вставить(Колонка.Имя, Неопределено);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТаблицаСвойств) Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураДанныхПередЗаписью, ТаблицаСвойств[0]);
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ДанныеПередЗаписью", СтруктураДанныхПередЗаписью);
		
КонецПроцедуры

// Процедура - Инициализация мехнизма работы с чат ботом
//
Процедура ИнициализацияМехнизмаРаботыСЧатБотом()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеПередЗаписью = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ДанныеПередЗаписью", Неопределено);
	Если ЗначениеЗаполнено(ДанныеПередЗаписью) И НЕ ДанныеПередЗаписью.Параметры = Неопределено Тогда 
		ПараметрыСистемы = ДанныеПередЗаписью.Параметры.Получить();
		Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСистемы, "Подписка", Неопределено))
			И СценарииНеИнициализированы() Тогда
			Попытка
				ОператорСообщения = Константы.СотрудникЧатБота.Получить();
				Если НЕ ЗначениеЗаполнено(ОператорСообщения) Тогда 
					Константы.СотрудникЧатБота.СгенерироватьСотрудникаЧатБота();
				КонецЕсли;
				ТаблицаСервисовРассылки = Справочники.СтруктурныеЕдиницы.ПолучитьТаблицуСервисовРассылокДляСтруктурныхЕдиниц();
				ОбновлениеИнформационнойБазыСтоматология.ИнициализацияСтандартногоНабораТриггеров(ТаблицаСервисовРассылки);
				ОбновлениеИнформационнойБазыСтоматология.ИнициализацияПредопределенныхСценариевЧатБота(Ложь, ТаблицаСервисовРассылки);
				ОбновлениеИнформационнойБазыСтоматология.ИнициализироватьМеханизмРекомендаций(ТаблицаСервисовРассылки);
			Исключение
				ОбщегоНазначения.СообщитьПользователю("При инициализации механизма для работы с чат-ботом произошла исключительная ситуация. Смотри подробности в журнале регистрации");
				
				МетаданныеСправочника 				= Метаданные.Справочники.ВнешниеСистемы;		
				ШаблонКомментария = НСтр("ru = 'При инициализации механизма для работы с чат-ботом произошла исключительная ситуация 
				|по причине: %1'");
				
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
				, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(Справочники.ВнешниеСистемы.СобытиеЖурналаРегистрации()
				, УровеньЖурналаРегистрации.Предупреждение
				, МетаданныеСправочника
				,
				, Комментарий);				
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Функция - Сценарии не инициализированы
// 
// Возвращаемое значение:
//   - 
//
Функция СценарииНеИнициализированы()	
		
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяМакетаПредопределенногоСценария", "ПодтверждениеЗаписиНаПрием");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СценарииЧатБотов.Ссылка КАК СценарийЧатБота
	|ИЗ
	|	Справочник.СценарииЧатБотов КАК СценарииЧатБотов
	|ГДЕ
	|	СценарииЧатБотов.ПометкаУдаления = ЛОЖЬ
	|	И СценарииЧатБотов.ИмяМакетаПредопределенногоСценария = &ИмяМакетаПредопределенногоСценария";
	
    Возврат Запрос.Выполнить().Пустой();
	
КонецФункции 

Функция ПолучитьТаблицуСервисовРассылки()
	
	
КонецФункции

#КонецОбласти
